src/test/resources/plays/refund/full_refund_payment.yaml

!play
interactions:
-
  request:
    uri: /v2/payments/PAY-MMU64JJBUI6Z/refunds
    headers:
      Content-Type: application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 201
    headers:
      "Content-Type": application/json
    body: |
      {
          "id": "REF-DBM34ELHHHS6",
          "status": "COMPLETED",
          "events": [
              {
                  "type": "REFUND.COMPLETED",
                  "createdAt": "2018-07-17T14:13:22.000-03"
              },
              {
                  "type": "REFUND.REQUESTED",
                  "createdAt": "2018-07-17T14:13:22.000-03"
              }
          ],
          "amount": {
              "total": 11000,
              "fees": 0,
              "currency": "BRL"
          },
          "receiversDebited": [
              {
                  "amount": 9873,
                  "moipAccount": "MPA-CULBBYHD11"
              }
          ],
          "type": "FULL",
          "refundingInstrument": {
              "creditCard": {
                  "brand": "MASTERCARD",
                  "first6": "555566",
                  "last4": "8884",
                  "store": true
              },
              "method": "CREDIT_CARD"
          },
          "createdAt": "2018-07-17T14:13:22.000-03",
          "_links": {
              "self": {
                  "href": "https://sandbox.moip.com.br/v2/refunds/REF-DBM34ELHHHS6"
              },
              "order": {
                  "href": "https://sandbox.moip.com.br/v2/orders/ORD-J5F0JITE58DV",
                  "title": "ORD-J5F0JITE58DV"
              },
              "payment": {
                  "href": "https://sandbox.moip.com.br/v2/payments/PAY-MMU64JJBUI6Z",
                  "title": "PAY-MMU64JJBUI6Z"
              }
          }
      }