src/test/resources/plays/refund/partial_refund_order.yaml

!play
interactions:
-
  request:
    uri: /v2/orders/ORD-PCSMIB5VZWGN/refunds
    headers:
      Content-Type: application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: POST
  response:
    status: 201
    headers:
      "Content-Type": application/json
    body: |
      {
          "id": "REF-ZRNB6YXA3DVN",
          "status": "COMPLETED",
          "events": [
              {
                  "type": "REFUND.COMPLETED",
                  "createdAt": "2018-07-17T16:36:07.000-03"
              },
              {
                  "type": "REFUND.REQUESTED",
                  "createdAt": "2018-07-17T16:36:06.000-03"
              }
          ],
          "amount": {
              "total": 8500,
              "fees": 0,
              "currency": "BRL"
          },
          "receiversDebited": [
              {
                  "amount": 8500,
                  "moipAccount": "MPA-CULBBYHD11"
              }
          ],
          "type": "PARTIAL",
          "refundingInstrument": {
              "creditCard": {
                  "brand": "MASTERCARD",
                  "first6": "555566",
                  "last4": "8884",
                  "store": true
              },
              "method": "CREDIT_CARD"
          },
          "createdAt": "2018-07-17T16:36:06.000-03",
          "_links": {
              "self": {
                  "href": "https://sandbox.moip.com.br/v2/refunds/REF-ZRNB6YXA3DVN"
              },
              "order": {
                  "href": "https://sandbox.moip.com.br/v2/orders/ORD-PCSMIB5VZWGN",
                  "title": "ORD-PCSMIB5VZWGN"
              },
              "payment": {
                  "href": "https://sandbox.moip.com.br/v2/payments/PAY-NG0P224NUIWR",
                  "title": "PAY-NG0P224NUIWR"
              }
          }
      }